In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'order_id':[1,1,1,2,3,3],
                  'price':[5,6,1,20,2,5]})
df

   order_id  price
0         1      5
1         1      6
2         1      1
3         2     20
4         3      2
5         3      5

## Calculate the total price of each order

In [3]:
df.groupby('order_id').price.sum()

order_id
1    12
2    20
3     7
Name: price, dtype: int64

In [4]:
df['sum'] = df.groupby('order_id').price.sum()

In [5]:
df

   order_id  price   sum
0         1      5   NaN
1         1      6  12.0
2         1      1  20.0
3         2     20   7.0
4         3      2   NaN
5         3      5   NaN

##  Use transform() to change the shape of the output

In [6]:
df.groupby('order_id').price.transform(sum)

0    12
1    12
2    12
3    20
4     7
5     7
Name: price, dtype: int64

In [7]:
df['transform_sum'] = df.groupby('order_id').price.transform(sum)

In [8]:
df

   order_id  price   sum  transform_sum
0         1      5   NaN             12
1         1      6  12.0             12
2         1      1  20.0             12
3         2     20   7.0             20
4         3      2   NaN              7
5         3      5   NaN              7